baseCase_benchmark/base_sim/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                    GAMG;
        smoother                  DICGaussSeidel;
        tolerance                 1e-06;
        relTol                    0.01;
        cacheAgglomeration        yes;
        nCellsInCoarsestLevel     10;
        processorAgglomerator     none;
        nPreSweeps                0;
        preSweepsLevelMultiplier  1;
        maxPreSweeps              10;
        nPostSweeps               2;
        postSweepsLevelMultiplier 1;
        maxPostSweeps             10;
        nFinestSweeps             2;
        interpolateCorrection     no;
        scaleCorrection           yes;
        directSolveCoarsest       no;
        coarsestLevelCorr
        {
            solver          PCG;
            preconditioner  DIC;
            tolerance       1e-06;
            relTol          0.01;
        }
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    Phi
    {
        $p;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

PIMPLE
{
    momentumPredictor   yes;
    transonic           no;
    nOuterCorrectors    50;
    nCorrectors         1;
    nNonOrthogonalCorrectors 1;
    consistent          yes;

    residualControl
    {
        "(U|p)"
        {
            relTol          0;
            tolerance       1e-05;
        }
    }
}


// ************************************************************************* //
